{
  "1": {
    "name": "Giai đoạn 1: Bối cảnh và Hiệp định Giơnevơ (1954)",
    "questions": [
      [
        "Tình hình sau Hiệp định Giơnevơ 1954?",
        "Giơnevơ chia nước ở vĩ tuyến 17_ Bắc khôi phục, Nam do Diệm (Mỹ hậu thuẫn), nhiệm vụ_ giữ lực lượng và chuẩn bị thống nhất"
      ],
      [
        "Mục tiêu pháp lý của Hiệp định Giơnevơ là gì?",
        "mục tiêu pháp lý giơnevo"
      ],
      [
        "Sự kiện ngày 20-21 tháng 7 năm 1954 là gì?",
        "Ngày 20–21 tháng 7 năm 1954 – một mốc lịch sử quan trọng đã thay đổi cục diện Đông Dương"
      ],
      [
        "Sau Hiệp định Giơnevơ 1954, quân đội hai bên làm gì?",
        "Sau Hiệp định Giơnevơ năm 1954, quân đội hai bên thực hiện điều gì"
      ],
      [
        "Sau Hiệp định Giơnevơ, miền Bắc đã làm gì?",
        "Sau Hiệp định Giơnevơ, lực lượng cách mạng ở miền Bắc đã làm gì để chuẩn bị cho nhiệm vụ lâu dài"
      ],
      [
        "Sau Hiệp định Giơnevơ, thời cơ nào để tổ chức tổng tuyển cử?",
        "Sau Hiệp định Giơnevơ, thời cơ nào đã tạo điều kiện cho Việt Nam tổ chức tổng tuyển cử thống nhất đất nước"
      ],
      [
        "Ý nghĩa của vĩ tuyến 17 theo Hiệp định Giơnevơ?",
        "Theo Hiệp định Giơnevơ, việc lấy vĩ tuyến 17 làm ranh giới quân sự tạm thời có ý nghĩa gì"
      ],
      [
        "Ý nghĩa của chiến thắng Điện Biên Phủ là gì?",
        "ý nghĩa sau chiến thắng điện biên phủ"
      ]
    ]
  },
  "2": {
    "name": "Giai đoạn 2: Thời kỳ đầu chia cắt (1954 - 1960)",
    "questions": [
      [
        "Tình hình 2 miền Nam-Bắc sau khi Diệm hủy tổng tuyển cử?",
        "Diệm hủy tổng tuyển cử, siết cai trị với Mỹ hậu thuẫn_ miền Nam bắt bớ khiến cách mạng vào bí mật, còn miền Bắc xây kinh tế–quốc phòng làm chỗ dựa"
      ],
      [
        "Miền Bắc đã làm gì sau cải cách ruộng đất?",
        "Miền Bắc hoàn tất cải cách ruộng đất, kinh tế phục hồi thành chỗ dựa_ miền Nam giữ hạt nhân bí mật, manh nha tự vệ vũ trang—thế Bắc hậu phương, Nam chiến trường ngày càng rõ"
      ],
      [
        "Miền Bắc đã chi viện cho miền Nam như thế nào?",
        "Miền Bắc tăng tốc xây dựng để chi viện_ miền Nam củng cố cơ sở, nhen nhóm tự vệ dù bị truy quét_ toàn dân chuẩn bị cho chuyển thế lớn"
      ],
      [
        "Nghị quyết 15 (NQ15) và việc mở đường Trường Sơn?",
        "NQ15 xác định bạo lực cách mạng ở miền Nam_ Sài Gòn ban Luật 10-59 đàn áp cực độ_ Đoàn 559 mở tuyến Trường Sơn chi viện_ Nam Bộ nổi dậy—bước ngoặt từ giữ lực lượng sang thế tiến công"
      ],
      [
        "Chuyện gì xảy ra với cuộc tổng tuyển cử?",
        "Tổng tuyển cử theo Giơnevơ bị phá_ miền Nam siết kiểm soát, mở nhà giam, còn miền Bắc chỉnh đốn tổ chức, sản xuất và sẵn sàng chi viện người–vũ khí cho miền Nam"
      ],
      [
        "Kể về phong trào Đồng Khởi ở Bến Tre.",
        "Đồng Khởi bùng nổ từ Bến Tre lan khắp Nam Bộ–Tây Nguyên, phá thế kìm kẹp nông thôn, dẫn tới ra đời Mặt trận Dân tộc Giải phóng miền Nam (20-12-1960), nhân dân giành quyền làm chủ ở nhiều vùng rộng lớn"
      ]
    ]
  },
  "3": {
    "name": "Giai đoạn 3: Chiến tranh Đặc biệt (1961 - 1964)",
    "questions": [
      [
        "MACV là gì và vai trò của nó ra sao?",
        "Mỹ lập MACV, tăng trực thăng vận và cơ giới hóa, nhưng gặp kháng cự rộng khắp_ phong trào phá ấp lan nhanh làm rỗng chương trình, lực lượng giải phóng trưởng thành mạnh"
      ],
      [
        "'Chiến tranh đặc biệt' của Mỹ-Diệm là gì?",
        "Mỹ–Diệm mở “Chiến tranh đặc biệt” (cố vấn, trực thăng, ấp chiến lược) nhưng ta bám dân phá ấp, phát triển du kích, mở rộng vùng giải phóng, khiến Sài Gòn khó kiểm soát và cán cân không nghiêng về phía Mỹ như kỳ vọng"
      ],
      [
        "Sự kiện Vịnh Bắc Bộ là gì?",
        "Sài Gòn bất ổn vì đảo chính_ sự kiện Vịnh Bắc Bộ cho Mỹ cái cớ mở rộng chiến tranh, “đặc biệt” coi như thất bại, Washington chuẩn bị đổ quân và ném bom miền Bắc—cục diện bước sang giai đoạn khốc liệt hơn"
      ],
      [
        "Kể về trận Ấp Bắc và khủng hoảng Phật giáo 1963.",
        "Thắng lợi Ấp Bắc cùng khủng hoảng Phật giáo làm Sài Gòn rúng động, Diệm–Nhu bị lật đổ (11-1963), “chiến tranh đặc biệt” bế tắc và Mỹ đứng trước ngã rẽ _leo thang_"
      ]
    ]
  },
  "4": {
    "name": "Giai đoạn 4: Chiến tranh Cục bộ (1965 - 1968)",
    "questions": [
      [
        "Chiến dịch Mùa khô lần 2 (Junction City) diễn ra sao?",
        "Mùa khô lần 2 (có Junction City) khiến thương vong Mỹ tăng và phản chiến nhen nhóm, ta vừa tiêu diệt sinh lực vừa giữ lực lượng mở bàn đạp, trong khi Sài Gòn loay hoay bầu cử"
      ],
      [
        "Kể về sự kiện Mậu Thân 1968.",
        "Mậu Thân 1968_ ta đồng loạt đánh vào hầu hết đô thị, Khe Sanh hút quân Mỹ_ cú sốc chính trị–tâm lý buộc Johnson ngừng ném bom hạn chế, không tái tranh cử và mở đàm phán Paris"
      ],
      [
        "Mỹ bắt đầu 'chiến tranh cục bộ' và Rolling Thunder như thế nào?",
        "Mỹ đổ bộ Đà Nẵng mở “chiến tranh cục bộ” và ném bom miền Bắc (Rolling Thunder)_ ta thắng Vạn Tường bẻ “tìm diệt”, miền Bắc vừa sản xuất vừa chiến đấu vẫn chi viện, chiến tranh bước vào giai đoạn ác liệt"
      ],
      [
        "Chiến dịch mùa khô lần thứ nhất diễn ra như thế nào?",
        "Mỹ–ngụy mở _mùa khô lần 1_ với hỏa lực lớn nhưng ta đánh bại nhiều cuộc càn, giữ vững vùng và chủ lực_ “tìm diệt” thất bại, miền Bắc duy trì giao thông–sản xuất–chiến đấu nhịp nhàng, và Mỹ bắt đầu sa lầy"
      ]
    ]
  },
  "5": {
    "name": "Giai đoạn 5: Việt Nam hóa Chiến tranh (1969 - 1973)",
    "questions": [
      [
        "Nội dung của Hiệp định Paris 1973 là gì?",
        "Hiệp định Paris (27-1-1973)_ Mỹ rút quân, trao trả tù binh_ ta củng cố lực lượng, mở rộng vùng giải phóng, miền Bắc tăng sản xuất–chi viện, trong khi Sài Gòn phá hoại nhưng yếu thế"
      ],
      [
        "Chiến dịch Lam Sơn 719 diễn ra như thế nào?",
        "Lam Sơn 719_ quân Sài Gòn (có Mỹ yểm trợ) đánh sang Nam Lào nhằm cắt Trường Sơn nhưng bị ta đánh bại nặng, lộ rõ điểm yếu, tuyến chi viện vẫn an toàn, ta giữ thế chủ động và củng cố niềm tin tất thắng"
      ],
      [
        "Tại sao Mỹ và Sài Gòn đánh sang Campuchia?",
        "Mỹ–Sài Gòn đánh sang Campuchia để cắt chi viện, nhưng ta phối hợp ba nước Đông Dương nối liền hành lang–hậu cứ, mở rộng vùng giải phóng_ miền Bắc tăng sản xuất–chi viện, bộc lộ rõ bất cập của “Việt Nam hoá”"
      ],
      [
        "Kể về Mùa hè đỏ lửa 1972 (Tiến công Trị-Thiên, Tây Nguyên).",
        "Năm 1972, ta tiến công lớn ở Trị–Thiên, Tây Nguyên, Đông Nam Bộ_ Mỹ đáp trả bằng Linebacker và B-52 “Điện Biên Phủ trên không” nhưng Hà Nội–Hải Phòng đứng vững, buộc Mỹ nhượng bộ và mở đường ký Hiệp định Paris"
      ],
      [
        "'Việt Nam hóa chiến tranh' của Nixon là gì?",
        "Nixon thực hiện “Việt Nam hoá”_ rút dần quân Mỹ, giao gánh nặng cho quân Sài Gòn_ ta vừa tiến công vừa đấu tranh ngoại giao_ Bác Hồ qua đời, phong trào phản chiến Mỹ lan rộng—thế chiến lược nghiêng về phía ta"
      ]
    ]
  },
  "6": {
    "name": "Giai đoạn 6: Hướng tới Thống nhất (1973 - 1975)",
    "questions": [
      [
        "Kể về sự kiện 30 tháng 4 năm 1975.",
        "Ta thắng Buôn Ma Thuột, Huế–Đà Nẵng sụp_ Hồ Chí Minh toàn thắng, 30-4-1975 Dương Văn Minh đầu hàng_ miền Nam giải phóng, thống nhất"
      ],
      [
        "Tình hình Sài Gòn trước 1975 như thế nào?",
        "Ta thử lửa chiến dịch vừa, rạn phòng ngự địch_ Sài Gòn khủng hoảng_ Bộ Chính trị chốt phương án tổng tiến công"
      ]
    ]
  }
}