{
  "1": {
    "name": "Giai đoạn 1: Bối cảnh và Hiệp định Giơnevơ (1954)",
    "questions": [
      [
        "Tình hình sau Hiệp định Giơnevơ 1954?",
        "sự kiện năm 1954, hiệp định giơnevo tạm chia việt nam ở vị tuyến 17, hình thành 2 miền với 2 chế độ dối nghịch"
      ],
      [
        "Mục tiêu pháp lý của Hiệp định Giơnevơ là gì?",
        "mục tiêu phát lý giơnevo"
      ],
      [
        "Sự kiện ngày 20-21 tháng 7 năm 1954 là gì?",
        "Ngày 20–21 tháng 7 năm 1954 – một mốc lịch sử quan trọng đã thay đổi cục diện Đông Dương"
      ],
      [
        "Sau Hiệp định Giơnevơ 1954, quân đội hai bên làm gì?",
        "Sau Hiệp định Giơnevơ năm 1954, quân đội hai bên thực hiện điều gì"
      ],
      [
        "Sau Hiệp định Giơnevơ, miền Bắc đã làm gì?",
        "Sau Hiệp định Giơnevơ, lực lượng cách mạng ở miền Bắc đã làm gì để chuẩn bị cho nhiệm vụ lâu dài"
      ],
      [
        "Sau Hiệp định Giơnevơ, thời cơ nào để tổ chức tổng tuyển cử?",
        "Sau Hiệp định Giơnevơ, thời cơ nào đã tạo điều kiện cho Việt Nam tổ chức tổng tuyển cử thống nhất đất nước"
      ],
      [
        "Ý nghĩa của vĩ tuyến 17 theo Hiệp định Giơnevơ?",
        "Theo Hiệp định Giơnevơ, việc lấy vĩ tuyến 17 làm ranh giới quân sự tạm thời có ý nghĩa gì"
      ],
      [
        "Ý nghĩa của chiến thắng Điện Biên Phủ là gì?",
        "ý nghĩa sau chiến thắng điện biên phủ"
      ]
    ]
  },
  "2": {
    "name": "Giai đoạn 2: Thời kỳ đầu chia cắt (1954 - 1960)",
    "questions": [
      [
        "Tình hình 2 miền Nam-Bắc sau khi Diệm hủy tổng tuyển cử?",
        "sự kiện năm 1955, diệm phế chuất bảo đại, bác bỏ tổng tuyển cử , thống nhất"
      ],
      [
        "Miền Bắc đã làm gì sau cải cách ruộng đất?",
        "sự kiện năm 1957, mien bắc cơ bản hoàn thành cải cách ruộng đất, chuyển sanh phục hồi và phát triển Kinh tế"
      ],
      [
        "Miền Bắc đã chi viện cho miền Nam như thế nào?",
        "sự kiện năm 1958, miền bắc chuẩn bị cho việc chi viện lâu dài, cách mạng miền nam được củng cố"
      ],
      [
        "Nghị quyết 15 (NQ15) và việc mở đường Trường Sơn?",
        "sự kiện năm 1959,ban hành nghị quyết số 15 , sài gòn thông qua luật 10 59 lập toàn đặc biệt , đoàn 559 ra đời"
      ],
      [
        "Chuyện gì xảy ra với cuộc tổng tuyển cử?",
        "sự kiện năm 1956, tổng tuyển cử theo gionevo không được thực hiện , chiên dịch tố cộng duyệt cộng được mở rộng"
      ],
      [
        "Kể về phong trào Đồng Khởi ở Bến Tre.",
        "sự kiện năm 1960,phong trào đồng khỏi bùng nổ"
      ]
    ]
  },
  "3": {
    "name": "Giai đoạn 3: Chiến tranh Đặc biệt (1961 - 1964)",
    "questions": [
      [
        "MACV là gì và vai trò của nó ra sao?",
        "sự kiện năm 1962, mỹ lập ra bộ chỉ huy viện trợ quân sự MACV"
      ],
      [
        "'Chiến tranh đặc biệt' của Mỹ-Diệm là gì?",
        "sự kiện năm 1961, mỹ diệm truyền khai chiến tranh đặc biệt"
      ],
      [
        "Sự kiện Vịnh Bắc Bộ là gì?",
        "sự kiện năm 1964, chiến tranh đặc biệt thất bại, mỹ chuyển bị đánh sang miền bắc"
      ],
      [
        "Kể về trận Ấp Bắc và khủng hoảng Phật giáo 1963.",
        "sự kiện năm 1963, thắng lợi ấp bắc, khủng hoảng phật giáo làm rúng động sài gon"
      ]
    ]
  },
  "4": {
    "name": "Giai đoạn 4: Chiến tranh Cục bộ (1965 - 1968)",
    "questions": [
      [
        "Chiến dịch Mùa khô lần 2 (Junction City) diễn ra sao?",
        "sự kiện năm 1967.mỹ nguỹ mở mùa khô lần 2"
      ],
      [
        "Kể về sự kiện Mậu Thân 1968.",
        "sự kiện năm 1968,tổng tiến công và nổi dậy tết mậu thân"
      ],
      [
        "Mỹ bắt đầu 'chiến tranh cục bộ' và Rolling Thunder như thế nào?",
        "sự kiện năm 1965, thuỷ quân lục chiến mỹ đổ bộ vào đà nẵng, khởi đấu chiến tranh cuc bộ"
      ],
      [
        "Chiến dịch mùa khô lần thứ nhất diễn ra như thế nào?",
        "sự kiện năm 1966, mỹ nguỵ mở mùa khô đợt 1"
      ]
    ]
  },
  "5": {
    "name": "Giai đoạn 5: Việt Nam hóa Chiến tranh (1969 - 1973)",
    "questions": [
      [
        "Nội dung của Hiệp định Paris 1973 là gì?",
        "sự kiện năm 1973, hiệp định paris được ký"
      ],
      [
        "Chiến dịch Lam Sơn 719 diễn ra như thế nào?",
        "sự kiện năm 1971, mở trận lam sơn 719 hay đường 9 nam lào"
      ],
      [
        "Tại sao Mỹ và Sài Gòn đánh sang Campuchia?",
        "sự kiện năm 1970, mỹ và sài gon mở trộng chiến tranh sang campuchia"
      ],
      [
        "Kể về Mùa hè đỏ lửa 1972 (Tiến công Trị-Thiên, Tây Nguyên).",
        "sự kiện năm 1972, mở chiên công chiến lược trị thiên , tây nguyên và đông nam bộ  , điện biên phủ trên không"
      ],
      [
        "'Việt Nam hóa chiến tranh' của Nixon là gì?",
        "sự kiện năm 1969. Nixon công bố việt nam hoá chiến tranh"
      ]
    ]
  },
  "6": {
    "name": "Giai đoạn 6: Hướng tới Thống nhất (1973 - 1975)",
    "questions": [
      [
        "Kể về sự kiện 30 tháng 4 năm 1975.",
        "sự kiện năm 1975, nổ súng ở tây nguyên thắng lớn ở buôn ma thuột , chiến dịch hồ chí minh toàn thắng , dương văn minh đầu hàng"
      ],
      [
        "Tình hình Sài Gòn trước 1975 như thế nào?",
        "sự kiện năm 1974, thử lửa bằng chiến dịch quy mô vừa, kinh tế chính trị sai gòn rơi vào khủng hoàng"
      ]
    ]
  }
}
